GHB2/src/BusinessProcesses/Подписание/Подписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>Подписание</name>
  <task>Task.СогласованиеДокумента</task>
  <attributes>
    <name>ПодписываемыйОбъект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПодписания</name>
    <type>
      <types>CatalogRef.но_МаршрутыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.но_СостояниеПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПриориет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторПодписания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияСогласования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПодписания</name>
    <attributes>
      <name>Стадия</name>
      <type>
        <types>CatalogRef.но_РолиДокументооборота</types>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписаниеВсех</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Редактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПодписания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДействия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.но_РолиДокументооборота</types>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеСобытие</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПодписи</name>
      <type>
        <types>EnumRef.но_СостояниеПодписи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СозданнаяЗадача</name>
      <type>
        <types>TaskRef.СогласованиеДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО_Документа</name>
      <type>
        <types>CatalogRef.гхб_ЦФО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаУведомлений</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.но_РолиДокументооборота</types>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

GHB2/src/Enums/но_СостояниеПодписи/но_СостояниеПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>но_СостояниеПодписи</name>
  <enumValues>
    <name>НаОзнакомлении</name>
  </enumValues>
  <enumValues>
    <name>Ознакомлен</name>
  </enumValues>
  <enumValues>
    <name>НаПодписании</name>
  </enumValues>
  <enumValues>
    <name>Ожидает</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Заблокирован</name>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Catalogs/но_МаршрутыСогласования/но_МаршрутыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>но_МаршрутыСогласования</name>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.но_ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИсточник</name>
    <type>
      <types>CatalogRef.гхб_ВнешниеИсточники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПодписей</name>
    <attributes>
      <name>РольДокументооборота</name>
      <type>
        <types>CatalogRef.но_РолиДокументооборота</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Редактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВхожденияВМаршрут</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеУсловияВхождения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаУведомлений</name>
    <attributes>
      <name>РольДокументооборота</name>
      <type>
        <types>CatalogRef.но_РолиДокументооборота</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SMS</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВхожденияВМаршрут</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеУсловияВхождения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПодписи</name>
    <attributes>
      <name>РольДокументооборота</name>
      <type>
        <types>CatalogRef.но_РолиДокументооборота</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеУведомления</name>
    <attributes>
      <name>РольДокументооборота</name>
      <type>
        <types>CatalogRef.но_РолиДокументооборота</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.гхб_ПодразделенияОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GHB2/src/BusinessProcesses/Подписание/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьТекущуюСтрокуПодписания(_Объект) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПодписаниеТаблицаПодписания.Ссылка,
	               |	ПодписаниеТаблицаПодписания.НомерСтроки КАК НомерСтроки,
	               |	ПодписаниеТаблицаПодписания.Стадия,
	               |	ПодписаниеТаблицаПодписания.ПодписаниеВсех,
	               |	ПодписаниеТаблицаПодписания.Приоритет,
	               |	ПодписаниеТаблицаПодписания.Email,
	               |	ПодписаниеТаблицаПодписания.SMS,
	               |	ПодписаниеТаблицаПодписания.Редактирование,
	               |	ПодписаниеТаблицаПодписания.СрокПодписания,
	               |	ПодписаниеТаблицаПодписания.ВидДействия,
	               |	ПодписаниеТаблицаПодписания.Получатель,
	               |	ПодписаниеТаблицаПодписания.БазовоеСобытие,
	               |	ПодписаниеТаблицаПодписания.ДатаВыдачи,
	               |	ПодписаниеТаблицаПодписания.СостояниеПодписи,
	               |	ПодписаниеТаблицаПодписания.ДатаПодписания,
	               |	ПодписаниеТаблицаПодписания.Сотрудник,
	               |	ПодписаниеТаблицаПодписания.Комментарии,
	               |	ПодписаниеТаблицаПодписания.СозданнаяЗадача,
	               |	ПодписаниеТаблицаПодписания.Подразделение,
	               |	ПодписаниеТаблицаПодписания.Должность
	               |ИЗ
	               |	БизнесПроцесс.Подписание.ТаблицаПодписания КАК ПодписаниеТаблицаПодписания
	               |ГДЕ
	               |	ПодписаниеТаблицаПодписания.СостояниеПодписи = &НаПодписании
	               |	И ПодписаниеТаблицаПодписания.Ссылка.ПодписываемыйОбъект = &ПодписываемыйОбъект
	               |	И (НЕ ПодписаниеТаблицаПодписания.Ссылка.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
				   
	Запрос.УстановитьПараметр("ПодписываемыйОбъект", _Объект);
	Запрос.УстановитьПараметр("НаПодписании", Перечисления.но_СостояниеПодписи.НаПодписании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьСсылку(СсылкаНаОбъект, ХранНастроекОтборов) Экспорт
	
	_Отчет = гхб_ДокументооборотСервер.ПолучитьОтчетДляОбъекта(СсылкаНаОбъект.Метаданные());
	
	СКД = _Отчет.СКД;
	Постр1 = _Отчет.КН;
	//Постр1 = _Отчет.КомпоновщикНастроек;
	//Постр1 = Справочники.но_МаршрутыСогласования.ПолучитьПостроительДляОбъекта(СсылкаНаОбъект.Метаданные());
	
	гхб_ДокументооборотСервер.ВосстановитьХранилищеОтборовВПостроитель(Постр1, ХранНастроекОтборов);
	
	Постр1.Настройки.ПараметрыДанных.Элементы.Найти("Ссылка").Значение = СсылкаНаОбъект;
	Постр1.Настройки.ПараметрыДанных.Элементы.Найти("Ссылка").Использование = Истина;
	
	Если гхб_СогласованиеДокументов.ЕстьРеквизитДокумента("Ответственный", СсылкаНаОбъект.Метаданные()) Тогда
		//Постр1.Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДата").Значение = НачалоДня(ОбщегоНазначенияСервер.ТекущееВремя());
		Постр1.Настройки.ПараметрыДанных.Элементы.Найти("ОтветственныйЗаОбъект").Значение = СсылкаНаОбъект.Ответственный;
		//Постр1.Настройки.ПараметрыДанных.Элементы.Найти("ПричинаИзмененияСостояния").Значение = Перечисления.ПричиныИзмененияСостояния.Увольнение;
		
		//Постр1.Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДата").Использование = Истина;
		Постр1.Настройки.ПараметрыДанных.Элементы.Найти("ОтветственныйЗаОбъект").Использование = Истина;
		//Постр1.Настройки.ПараметрыДанных.Элементы.Найти("ПричинаИзмененияСостояния").Использование = Истина;
	КонецЕсли;
	
	_ТЗ = Новый ТаблицаЗначений();
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
     
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Постр1.Настройки, ДанныеРасшифровки, , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
     
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки, Истина);
     
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
     
    ПроцессорВывода.УстановитьОбъект(_ТЗ);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	Возврат НЕ (_ТЗ.Количество() = 0);
	
КонецФункции

Функция ВернутьПредопределенныйЭлементНаОснованииДокумента(пРоль, пДокумент, ТипОтбора = Неопределено) Экспорт 
	
	Попытка
		МетаданныеОбъекта = пДокумент.Метаданные();
	Исключение
		Возврат Справочники.гхб_ФизическиеЛица.ПустаяСсылка();
	КонецПопытки;
	
	Возврат пРоль;
	
КонецФункции

Функция ВернутьСписокМаршрутовДляОбъекта(_Объект) Экспорт 
	
	_Сп = Новый СписокЗначений();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МаршрутыСогласования.Ссылка КАК МаршрутПодписания
	                      |ИЗ
	                      |	Справочник.но_МаршрутыСогласования КАК МаршрутыСогласования
						  |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.но_ТипыДокументов КАК ТипыДокументов
						  |		ПО ТипыДокументов.Ссылка = МаршрутыСогласования.ТипДокумента
	                      |ГДЕ
	                      |	НЕ ТипыДокументов.ПометкаУдаления
	                      |	И НЕ МаршрутыСогласования.ПометкаУдаления
						  |	И (ТипыДокументов.ТипДокумента = &ТипДокумента1
						  |	ИЛИ ТипыДокументов.ТипДокумента = &ТипДокумента2)");
						  
	Запрос.УстановитьПараметр("ТипДокумента1", _Объект.Метаданные().Имя);
	Запрос.УстановитьПараметр("ТипДокумента2", _Объект.Метаданные().Синоним);
	_Сп.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МаршрутПодписания"));
	
	Возврат _Сп;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВернутьРольОтветственногоЗаЦФО(пЦФО)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	ОтветственныеЗаЦФОСрезПоследних.Пользователь КАК РольВладелецЦФО
						  |ИЗ
						  |	РегистрСведений.ОтветственныеЗаЦФО.СрезПоследних(
						  |		,
						  |		Пользователь ССЫЛКА Справочник.РолиДокументооборота
						  |			И ЦФО = &ЦФО) КАК ОтветственныеЗаЦФОСрезПоследних
						  |ГДЕ
						  |	ОтветственныеЗаЦФОСрезПоследних.Пользователь <> &ПустаяРоль");
	
	Запрос.УстановитьПараметр("ЦФО",пЦФО);
	Запрос.УстановитьПараметр("ПустаяРоль",Справочники.гхб_РолиДокументооборота.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.РольВладелецЦФО;
	Иначе
		Возврат Справочники.гхб_РолиДокументооборота.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
